{"type":"Certificate","name":"European Cultural Studies","code":"ECS","urls":["https://ua.princeton.edu/fields-study/certificate-programs/european-cultural-studies"],"contacts":[{"type":"Director","name":"Efthymia Rentzou","email":"erentzou@princeton.edu"}],"description":"The Program in European Cultural Studies (ECS) was established in 1975 on the joint initiative of faculty members in history, comparative literature, romance languages and literatures, politics and architecture, under the leadership of the eminent cultural historian Carl E. Schorske (1915-2015). Its first certificate class graduated in 1979. Now housed on the second floor of Scheide Caldwell House within the Andlinger Center for the Humanities, ECS enjoys the administrative support of the Council of the Humanities. Committed since its founding to encouraging students' engagement at an international level, ECS now also endeavors to situate the study of Europe in broader global contexts.","max_common_with_major":null,"declaration_limit":5,"pdfs_allowed":null,"req_list":[{"name":"Core Course","min_needed":1,"max_counted":1,"explanation":"All students must complete either HUM 216-219 or ECS/EPS 301 or EPS/ECS 302 to fulfill the ECS core course requirement. ","course_list":["ECS 301","ECS 302","HUM 216","HUM 217","HUM 218","HUM 219"]},{"name":"Electives","min_needed":2,"max_counted":1,"explanation":"In addition, they must complete a total of two more elective courses in ECS; these ECS elective courses may be taken at either the 300- or the 400 level. The majority of ECS courses are cross-listed with other departments in the humanities and social sciences.","course_list":["ECS 3**","ECS 4**"]},{"name":"ECS Excursion","max_counted":1,"explanation":"ECS certificate students take part in a full-day ECS excursion to a cultural event or exhibition in New York. Offered in the fall and spring, the ECS excursion typically takes place on a Friday or a Saturday, and always includes a discussion over a group meal. Participation in both parts of the ECS excursion (the cultural event and the mealtime discussion) is required of all ECS certificate students.","iw_relationship":"separate","no_req":null},{"name":"ECS Faber Lecture","max_counted":1,"explanation":"To complete the ECS Faber Lecture and Colloquium requirement, students attend the ECS Faber lecture, which is given annually by a distinguished visiting scholar. Held in connection with the annual ECS Faber lecture, the ECS Faber Colloquium offers certificate students the opportunity to join in a mealtime discussion with the ECS Faber lecturer. Participation in both parts of the ECS Faber Lecture and Colloquium is required of all ECS certificate students.","iw_relationship":"separate","no_req":null},{"name":"ECS Senior Thesis Colloquium","max_counted":1,"explanation":"In their senior year, ECS students participate in the Senior Thesis Colloquium. Although ECS certificate students complete their theses under the direction of their home departments, over the course of the spring term of senior year, all ECS seniors join the ECS director to meet one day a week, over a meal, for discussion of common challenges of research, conceptualization, organization and writing. Each student shares an excerpt from the senior thesis with the group during one of the colloquium's meetings. Senior thesis excerpts are circulated in advance, and active participation in the weekly senior thesis colloquium discussions is required of all ECS seniors. Though most ECS students address European topics in their theses, this is not a requirement of the program. For the purposes of the senior thesis colloquium, certificate students from the sciences or engineering may circulate a paper written for an ECS course in place of an excerpt from the senior thesis.","iw_relationship":"separate","no_req":null}]}