{"type":"Certificate","name":"Near Eastern Studies Program","code":"NES","urls":["https://ua.princeton.edu/fields-study/certificate-programs/near-eastern-studies-program"],"contacts":[{"type":"Director","name":"Jonathan M. Gribetz","email":"gribetz@princeton.edu"}],"description":"The Near Eastern Studies Program (NESP) provides students across the University the opportunity to study the languages, history, culture and institutions of the Near East and the broader Islamicate world. Its purpose is to enhance a liberal education and to offer additional training for students who plan a career in those areas.","max_common_with_major":null,"declaration_limit":null,"pdfs_allowed":null,"allowed_majors":["ANT","EAS","ECO","HIS","POL","REL","SOC","SPI"],"req_list":[{"name":"Language","min_needed":4,"max_counted":1,"explanation":"Students who have had no relevant language training must take at least two years of Arabic, Hebrew, Hindi/Urdu, Persian, Swahili or Turkish language as elective courses.","course_list":["ARA ***","HEB ***","HIN ***","PER ***","SWA ***","TUR ***","URD ***"]},{"name":"History","min_needed":1,"max_counted":1,"explanation":"All students will take at least one appropriate historically focused course in the Department of Near Eastern Studies. Students in the Department of History will take at least two such courses.","course_list":["NES ***"]},{"name":"Social Sciences","min_needed":2,"max_counted":1,"explanation":"NOTE: Please manually verify if the course content satisfies this requirement.\nAll students will take at least two courses treating the Islamicate world that are chosen from the offerings of the departments of anthropology, Near Eastern studies, politics, religion, and sociology, and the Princeton School of Public and International Affairs.","course_list":["ANT ***","NES ***","POL ***","REL ***","SOC ***","SPI ***"]},{"name":"Independent Work","max_counted":1,"explanation":"Ideally, the student's junior independent work would have at least a partial focus on the Near East or the broader Islamicate world. Alternatively, with the permission of the program director, the student may write a separate research paper, usually 25-30 pages in length, about a Near East-related subject, beyond the student's other course requirements.\nIdeally, the senior thesis is written on a Near Eastern or Islamicate subject under the supervision of a Near Eastern specialist in the appropriate department and the program. Alternatively, with the permission of the program director, the student may write a separate research paper, usually approximately 50 pages, about a Near East-related subject, beyond the student's other course requirements.\nStudents take the regular senior departmental examination given by their department, except that a portion of it deals with the Islamicate fields studied. These examinations are described in the sections of this catalog for each department.","iw_relationship":"hybrid","no_req":null}]}